/* clang-format off */
/*
 * @file proc.cpp
 * @date 2025-04-14
 * @license MIT License
 *
 * Copyright (c) 2025 BinRacer <native.lab@outlook.com>
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
 * SOFTWARE.
 */
/* clang-format on */
#include "proc.h"
#include "security.h"
#include "helper/autoclean.h"
#include <complex>
#include <memory>
#include <UserEnv.h>

#pragma comment(lib, "UserEnv.Lib")

namespace YanLib::sys {
    proc::~proc() {
        for (auto &info : proc_infos) {

    std::string proc::get_env_var(const std::string &var_name) {
        std::string var_value;
        uint32_t size =
                GetEnvironmentVariableA(var_name.data(), var_value.data(),
                                        var_value.size());
        if (size <= 0) {
            error_code = GetLastError();
            return {};
        }
        var_value.resize(size);
        size = GetEnvironmentVariableA(var_name.data(), var_value.data(),
                                       var_value.size());
        if (size <= 0) {
            error_code = GetLastError();
            return {};
        }
        while (var_value.back() == '\0') {
            var_value.pop_back();
        }
        return var_value;
    }

    std::wstring proc::get_env_var(const std::wstring &var_name) {
        std::wstring var_value;
        uint32_t size =
                GetEnvironmentVariableW(var_name.data(), var_value.data(),
                                        var_value.size());
        if (size <= 0) {
            error_code = GetLastError();
            return {};
        }
        var_value.resize(size);
        size = GetEnvironmentVariableW(var_name.data(), var_value.data(),
                                       var_value.size());
        if (size <= 0) {
            error_code = GetLastError();
            return {};
        }
        while (var_value.back() == '\0') {
            var_value.pop_back();
        }
        return var_value;
    }

    bool proc::set_env_var(const std::string &var_name,
                           const std::string &var_value) {
        if (!SetEnvironmentVariableA(var_name.data(),
                                     var_name.empty() ? nullptr
                                                      : var_value.data())) {
            error_code = GetLastError();
            return false;
        }
        return true;
    }

    bool proc::set_env_var(const std::wstring &var_name,
                           const std::wstring &var_value) {
        if (!SetEnvironmentVariableW(var_name.data(),
                                     var_name.empty() ? nullptr
                                                      : var_value.data())) {
            error_code = GetLastError();
            return false;
        }
        return true;
    }

    void proc::get_cmdline(std::string &cmdline) {
        cmdline.clear();
        cmdline = GetCommandLineA();
    }

    void proc::get_cmdline(std::wstring &cmdline) {
        cmdline.clear();
        cmdline = GetCommandLineW();
    }

    bool proc::get_cmdline(HANDLE proc_handle,
                           std::string &cmdline,
                           helper::CodePage code_page) {
        std::wstring src;
        if (!get_cmdline(proc_handle, src) || src.empty()) {
            return false;
        }
        cmdline = helper::convert::wstr_to_str(src, code_page);
        return true;
    }

    bool proc::get_cmdline(HANDLE proc_handle, std::wstring &cmdline) {
        // 0: kd> dt nt!_PEB
        // +0x000 InheritedAddressSpace : UChar
        // +0x001 ReadImageFileExecOptions : UChar
        // +0x002 BeingDebugged    : UChar
        // +0x003 BitField         : UChar
        // +0x003 ImageUsesLargePages : Pos 0, 1 Bit
        // +0x003 IsProtectedProcess : Pos 1, 1 Bit
        // +0x003 IsImageDynamicallyRelocated : Pos 2, 1 Bit
        // +0x003 SkipPatchingUser32Forwarders : Pos 3, 1 Bit
        // +0x003 IsPackagedProcess : Pos 4, 1 Bit
        // +0x003 IsAppContainer   : Pos 5, 1 Bit
        // +0x003 IsProtectedProcessLight : Pos 6, 1 Bit
        // +0x003 IsLongPathAwareProcess : Pos 7, 1 Bit
        // +0x004 Padding0         : [4] UChar
        // +0x008 Mutant           : Ptr64 Void
        // +0x010 ImageBaseAddress : Ptr64 Void
        // +0x018 Ldr              : Ptr64 _PEB_LDR_DATA
        // +0x020 ProcessParameters : Ptr64 _RTL_USER_PROCESS_PARAMETERS
        struct _peb {
            uint8_t fill[0x20];
            void *process_parameters;
        };

        // 0: kd> dt nt!_RTL_USER_PROCESS_PARAMETERS
        // +0x000 MaximumLength    : Uint4B
        // +0x004 Length           : Uint4B
        // +0x008 Flags            : Uint4B
        // +0x00c DebugFlags       : Uint4B
        // +0x010 ConsoleHandle    : Ptr64 Void
        // +0x018 ConsoleFlags     : Uint4B
        // +0x020 StandardInput    : Ptr64 Void
        // +0x028 StandardOutput   : Ptr64 Void
        // +0x030 StandardError    : Ptr64 Void
        // +0x038 CurrentDirectory : _CURDIR
        // +0x050 DllPath          : _UNICODE_STRING
        // +0x060 ImagePathName    : _UNICODE_STRING
        // +0x070 CommandLine      : _UNICODE_STRING
        // +0x080 Environment      : Ptr64 Void

        // 0: kd> dt _UNICODE_STRING
        // nt!_UNICODE_STRING
        // +0x000 Length           : Uint2B
        // +0x002 MaximumLength    : Uint2B
        // +0x008 Buffer           : Ptr64 Wchar
        struct _process_parameters {
            uint8_t fill[0x70 + 0x8];
            void *cmdline;
        };
        HANDLE process_handle = proc_handle ? proc_handle : GetCurrentProcess();
        uint32_t ret_size = 0;
        PROCESS_BASIC_INFORMATION pbi{};
        bool result = false;
        do {
            const NTSTATUS status =
                    nt_query_info_proc(process_handle, ProcessBasicInformation,
                                       &pbi, sizeof(pbi), &ret_size);
            if (!NT_SUCCESS(status)) {
                break;
            }
            const auto peb = std::make_unique<_peb>();
            size_t size = ret_size;
            if (!ReadProcessMemory(process_handle, pbi.PebBaseAddress,
                                   peb.get(), sizeof(_peb), &size)) {
                error_code = GetLastError();
                break;
            }
