//
// Created by forkernel on 2025/4/14.
//

#include "proc.h"

#include <algorithm>
#include <memory>

#include "security.h"
#include "helper/convert.h"
#include "helper/autoclean.h"
#include <UserEnv.h>

#pragma comment(lib, "UserEnv.lib")

namespace YanLib::sys {
    proc::~proc() {
        if (curr_proc_env) {
            FreeEnvironmentStringsW(curr_proc_env);
        }
        if (!proc_infos.empty()) {
            for (auto &info: proc_infos) {
                if (info.hThread) {
                    CloseHandle(info.hThread);
                    info.hThread = nullptr;
                }
                if (info.hProcess) {
                    CloseHandle(info.hProcess);
                    info.hProcess = nullptr;
                }
            }
            proc_infos.clear();
        }
        if (!proc_handles.empty()) {
            for (auto &proc_handle: proc_handles) {
                CloseHandle(proc_handle);
                proc_handle = nullptr;
            }
            proc_handles.clear();
        }
    }

    NTSTATUS proc::nt_query_info_proc(HANDLE proc_handle,
                                      PROCESSINFOCLASS proc_info_class,
                                      void *proc_info,
                                      unsigned long proc_info_len,
                                      unsigned long *ret_len) {
        typedef NTSTATUS (CALLBACK *pfn)(HANDLE ProcessHandle,

                                    const void *base_addr,
                                    size_t size) {
        std::vector<uint8_t> buffer(size, 0);
        size_t bytes_read = 0;
        if (!ReadProcessMemory(proc_handle,
                               base_addr,
                               buffer.data(),
                               buffer.size(),
                               &bytes_read)) {
            error_code = GetLastError();
            return {};
        }
        buffer.resize(bytes_read);
        buffer.shrink_to_fit();
        return buffer;
    }

    bool proc::write(HANDLE proc_handle,
                     void *base_addr,
                     std::vector<uint8_t> &buf) {
        if (buf.empty()) {
            return false;
        }
        size_t bytes_write = 0;
        if (!WriteProcessMemory(proc_handle,
                                base_addr,
                                buf.data(),
                                buf.size(),
                                &bytes_write)) {
            error_code = GetLastError();
            return false;
        }
        if (bytes_write != buf.size()) {
            return false;
        }
        return true;
    }

    void proc::flush_write_buffer() {
        FlushProcessWriteBuffers();
    }

    std::wstring proc::env_strings() {
        if (curr_proc_env) {
            return curr_proc_env;
        }
        curr_proc_env = GetEnvironmentStringsW();
        if (!curr_proc_env) {
            error_code = GetLastError();
        }
        return curr_proc_env;
    }

    std::wstring proc::get_env_var(std::wstring var_name) {
        std::wstring var_value;
        unsigned long size = GetEnvironmentVariableW(var_name.data(),
                                                     var_value.data(),
                                                     var_value.size());
        if (size <= 0) {
            error_code = GetLastError();
            return {};
        }
        var_value.resize(size);
        size = GetEnvironmentVariableW(var_name.data(),
                                       var_value.data(),
                                       var_value.size());
        if (size <= 0) {
            error_code = GetLastError();
            return {};
        }
        return var_value;
    }

    bool proc::set_env_var(std::wstring var_name, std::wstring var_value) {
        if (!SetEnvironmentVariableW(var_name.data(),
                                     var_value.data())) {
            error_code = GetLastError();
            return false;
        }
        return true;
    }

    std::wstring proc::cmdline() {
        return GetCommandLineW();
    }

    std::string proc::cmdline(HANDLE proc_handle) {
        std::wstring result = cmdline_wide(proc_handle);
        return helper::convert::wstr_to_str(result);
    }

    std::wstring proc::cmdline_wide(HANDLE proc_handle) {
        // 0: kd> dt nt!_PEB
        // +0x000 InheritedAddressSpace : UChar
        // +0x001 ReadImageFileExecOptions : UChar
        // +0x002 BeingDebugged    : UChar
        // +0x003 BitField         : UChar
        // +0x003 ImageUsesLargePages : Pos 0, 1 Bit
        // +0x003 IsProtectedProcess : Pos 1, 1 Bit
        // +0x003 IsImageDynamicallyRelocated : Pos 2, 1 Bit
        // +0x003 SkipPatchingUser32Forwarders : Pos 3, 1 Bit
        // +0x003 IsPackagedProcess : Pos 4, 1 Bit
        // +0x003 IsAppContainer   : Pos 5, 1 Bit
        // +0x003 IsProtectedProcessLight : Pos 6, 1 Bit
        // +0x003 IsLongPathAwareProcess : Pos 7, 1 Bit
        // +0x004 Padding0         : [4] UChar
        // +0x008 Mutant           : Ptr64 Void
        // +0x010 ImageBaseAddress : Ptr64 Void
        // +0x018 Ldr              : Ptr64 _PEB_LDR_DATA
        // +0x020 ProcessParameters : Ptr64 _RTL_USER_PROCESS_PARAMETERS
        struct _peb {
            uint8_t fill[0x20];
            void *process_parameters;
        };

        // 0: kd> dt nt!_RTL_USER_PROCESS_PARAMETERS
        // +0x000 MaximumLength    : Uint4B
        // +0x004 Length           : Uint4B
        // +0x008 Flags            : Uint4B
        // +0x00c DebugFlags       : Uint4B
        // +0x010 ConsoleHandle    : Ptr64 Void
        // +0x018 ConsoleFlags     : Uint4B
        // +0x020 StandardInput    : Ptr64 Void
        // +0x028 StandardOutput   : Ptr64 Void
        // +0x030 StandardError    : Ptr64 Void
        // +0x038 CurrentDirectory : _CURDIR
        // +0x050 DllPath          : _UNICODE_STRING
        // +0x060 ImagePathName    : _UNICODE_STRING
        // +0x070 CommandLine      : _UNICODE_STRING
        // +0x080 Environment      : Ptr64 Void

        // 0: kd> dt _UNICODE_STRING
        // nt!_UNICODE_STRING
        // +0x000 Length           : Uint2B
        // +0x002 MaximumLength    : Uint2B
        // +0x008 Buffer           : Ptr64 Wchar
        struct _process_parameters {
            uint8_t fill[0x70 + 0x8];
            void *cmdline;
        };
        HANDLE process_handle = proc_handle
                                    ? proc_handle
                                    : GetCurrentProcess();
        unsigned long ret_size = 0;
        PROCESS_BASIC_INFORMATION pbi{};
        do {
            NTSTATUS status = nt_query_info_proc(
                process_handle,
                ProcessBasicInformation,
                &pbi,
                sizeof(pbi),
                &ret_size);
            if (!NT_SUCCESS(status)) {
                break;
            }
            auto peb = std::make_unique<_peb>();
            size_t size = ret_size;
            if (!ReadProcessMemory(process_handle,
                                   pbi.PebBaseAddress,
                                   peb.get(),
                                   sizeof(_peb),
